jmeter/normal-traffic.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Normal Traffic - chaos-platform" enabled="true">
      <stringProp name="TestPlan.comments">通常トラフィック: 20 req/s を service-a /aggregate に流す。FIS / Envoy 実験の前提条件として使用。</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.arguments" elementType="Arguments">
        <collectionProp name="Arguments.arguments">
          <!-- -Jalb_host=<ALB_DNS> で上書き可能 -->
          <elementProp name="alb_host" elementType="Argument">
            <stringProp name="Argument.name">alb_host</stringProp>
            <stringProp name="Argument.value">${__P(alb_host,localhost)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="alb_port" elementType="Argument">
            <stringProp name="Argument.name">alb_port</stringProp>
            <stringProp name="Argument.value">${__P(alb_port,80)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="origin_secret" elementType="Argument">
            <stringProp name="Argument.name">origin_secret</stringProp>
            <stringProp name="Argument.value">${__P(origin_secret,)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <!-- target_rps: 通常=20, 高負荷=100 -->
          <elementProp name="target_rps" elementType="Argument">
            <stringProp name="Argument.name">target_rps</stringProp>
            <stringProp name="Argument.value">${__P(target_rps,20)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <!-- ============================================================
           Thread Group: 20 スレッド、60s でランプアップ、永続ループ
           実験終了後に JMeter を手動停止する
           ============================================================ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Normal Traffic" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${target_rps}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">60</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>

        <!-- ---- HTTP リクエスト: /aggregate/1 ---- -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /aggregate/1" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${alb_host}</stringProp>
          <stringProp name="HTTPSampler.port">${alb_port}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/aggregate/1</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <intProp name="HTTPSampler.connect_timeout">3000</intProp>
          <intProp name="HTTPSampler.response_timeout">10000</intProp>
        </HTTPSamplerProxy>
        <hashTree>

          <!-- ALB Origin Secret ヘッダー -->
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Headers" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="X-Origin-Verify" elementType="Header">
                <stringProp name="Header.name">X-Origin-Verify</stringProp>
                <stringProp name="Header.value">${origin_secret}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>

          <!-- 1 スレッドあたり 1 req/s を維持 (= target_rps req/s 全体) -->
          <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="1s Pacing" enabled="true">
            <stringProp name="ConstantTimer.delay">1000</stringProp>
          </ConstantTimer>

        </hashTree>

        <!-- ---- HTTP リクエスト: /aggregate/2 (item バリエーション) ---- -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /aggregate/2" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${alb_host}</stringProp>
          <stringProp name="HTTPSampler.port">${alb_port}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/aggregate/2</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <intProp name="HTTPSampler.connect_timeout">3000</intProp>
          <intProp name="HTTPSampler.response_timeout">10000</intProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Headers" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="X-Origin-Verify" elementType="Header">
                <stringProp name="Header.name">X-Origin-Verify</stringProp>
                <stringProp name="Header.value">${origin_secret}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="1s Pacing" enabled="true">
            <stringProp name="ConstantTimer.delay">1000</stringProp>
          </ConstantTimer>
        </hashTree>

      </hashTree>

      <!-- ============================================================
           結果収集: JTL ファイルに書き出し
           ============================================================ -->
      <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Save Results" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">results/normal-traffic.jtl</stringProp>
      </ResultCollector>

    </hashTree>
  </hashTree>
</jmeterTestPlan>